Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: The value rising edge indicates that the flip-flop should update its value at the instant when the clock rises from 0 to 1.
ru_ru: Значение Передний фронт означает, что триггер должен обновляться в момент, когда значение на тактовом входе меняется с 0 на 1.

source: The user can modify individual values interactively via the Poke Tool, or the user can modify the entire contents via the Menu Tool.
ru_ru: Пользователь может интерактивно изменять отдельные значения с помощью Инструмента Нажатие, или менять всё содержимое через Инструмент Меню.

source: I'll imagine that we have two files, named adder-master.circ and adder-query.circ.
ru_ru: Я представлю, что у нас есть два файла с именами adder-master.circ и adder-query.circ.

source: Next: Editing the truth table.
ru_ru: Далее: Редактирование таблицы истинности.

source: * of the code relevant to state, though, appears in CounterData class.
ru_ru: * код, относящийся к состоянию, появляется в классе CounterData.

source: To archive your completed work, you might want to save or print your circuit.
ru_ru: Чтобы сохранить вашу выполненную работу, вы можете сохранить или распечатать схему.

source: The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program (independent of having been made by running the Program).
ru_ru: Использование Программы по ее функциональному назначению не ограничено, и выходные данные Программы охватываются этой Лицензией, только если их содержание является произведением, основанным на Программе (вне зависимости от того, были ли они получены в процессе использования Программы).

source: However, as a special exception, the source code distributed need not include anything that is normally distributed (in either source or binary form) with the major components (compiler, kernel, and so on) of the operating system on which the executable runs, unless that component itself accompanies the executable.
ru_ru: Однако, в виде особого исключения распространяемый исходный код не обязан включать то, что обычно предоставляется с основными компонентами операционной системы, под управлением которой работает исполняемое произведение, за исключением случая, когда сам компонент сопровождает исполняемое произведение.

source: Logisim treats splitters specially when propagating values within a circuit: Whereas all other components have a computed delay for purposes of simulating their behavior, values propagate through splitters (as well as wires) instantaneously.
ru_ru: Logisim рассматривает разветвители особым образом при передаче значений по схеме: в то время как для всех остальных компонентов вычисляется задержка в целях моделирования их поведения, через разветвитель (а также провода) значения передаются мгновенно.

source: Next: The Experimental tab.
ru_ru: Далее: Вкладка Экспериментальные.

source: Pressing the mouse button while within the joystick area moves the knob to that location and updates the outputs.
ru_ru: Нажатие кнопки мыши в пределах области джойстика перемещает рукоятку к этому месту и обновляет выходы.

source: No spaces allowed!) It attempts to use the pins' existing labels, and to use a list of defaults if no label exists.
ru_ru: Пробелы не допускаются!) Logisim пытается использовать существующие метки контактов, или список умолчаний, если меток нет.

source: This does not affect the number of inputs, which is specified by the Number of Inputs attribute.
ru_ru: Это не влияет на количество входов, которое задаётся атрибутом Количество входов.

source: Error conditions - such as a detected oscillation - are displayed in any case.
ru_ru: Ситуации ошибки - такие как обнаруженное возбуждение - отображаются в любом случае.

source: Nonetheless, the input pins are in a line.
ru_ru: Тем не менее, входные контакты расположены вряд.

source: Often we want components that aren't exclusively combinational in nature - that is, we want the component to have some memory.
ru_ru: Часто нам нужны компоненты, которые не являются исключительно комбинационными по своей сути - то есть, мы хотим, чтобы компонент имел некоторую память.

source: The left side is an explorer listing all the tools available, and the list on the right side displays the current contents of the toolbar.
ru_ru: Левая часть - проводник со списком всех доступных инструментов, а список в правой части отображает текущее содержимое панели инструментов.

source: East edge (output, bit width according to Data Bits attribute)
ru_ru: Восточный край (выход, разрядность соответствует атрибуту Биты данных)

source: Values may be copied and pasted using the Edit menu; the clipboard can also be transferred into other applications.
ru_ru: Значения могут быть копированы и вставлены с помощью меню Правка; также, буфер обмена может быть передан в другие приложения.

source: The application preferences address preferences that span all open projects, whereas project options are specific to that one project.
ru_ru: Настройки приложения охватывают все открытые проекты, а параметры проекта специфичны для одного определённого проекта.

source: * a no-arguments constructor method of the user-designated class.
ru_ru: * метод-конструктор без аргументов объявленного пользователем класса.

source: Shaped:
ru_ru: Фигурные:

source: Load: When this is 1 while the count input is 0, the counter will load the value found at the data input at the next clock trigger - or, if the count input happens to be 1, the counter's value will decrement.
ru_ru: Загрузка: когда на этом входе 1, пока на входе счёт 0, счётчик загрузит значение со входа данные при следующем срабатывании тактового входа; или, если на входе счёт 1, значение счётчика уменьшится.

source: The clock's value will toggle on its schedule whenever ticks are enabled, and it will toggle whenever it is clicked using the Poke Tool.
ru_ru: Значение тактового генератора будет переключаться по своему расписанию, пока такты включены, или однократно, когда на него щёлкнули Инструментом Нажатие.

source: Shows a tab-delimited table containing statistics about components used by the top-level main circuit in the project.
ru_ru: Показывает таблицу с символами табуляции в качестве разделителей, содержащую статистику компонентов, используемых главной в проекте схемой верхнего уровня.

source: Bit Finder
ru_ru: Искатель битов

source: NO WARRANTY
ru_ru: НИКАКИХ ГАРАНТИЙ

source: Configures the template for Logisim to use.
ru_ru: Задаёт шаблон для использования в Logisim

source: Next: Simple Gray Code Counter.
ru_ru: Далее: Простой счётчик кода Грея.

source: The number of values stored in RAM is 2addrBitWidth.
ru_ru: Количество значений, хранящихся в ОЗУ равно 2Разрядность_адреса.

source: (Via the Project Options window's Simulation tab, you can configure Logisim to add a random, occasional delay to a component's propagation.
ru_ru: (Через вкладку Моделирование окна Параметры проекта вы можете настроить Logisim на добавление случайной задержки к просчёту компонента.

source: Some JAR libraries are distributed without any information about which Java class to start with.
ru_ru: Некоторые JAR библиотеки распространяются без какой-либо информации о том, с какого класса Java начинать.

source: We might design such a circuit on paper.
ru_ru: Мы могли бы разработать такую схему на бумаге.

source: There are a some additional options related to command-line execution.
ru_ru: Есть несколько дополнительных параметров, связанных с выполнением из командной строки.

source: Select Tool
ru_ru: Инструмент Выбор

source: Joystick
ru_ru: Джойстик

source: Three Logisim packages define most of the classes relevant to defining component libraries.
ru_ru: Три пакета Logisim объявляют большинство классов, имеющих отношение к объявлению библиотек компонентов.

source: The overall command-line syntax is as follows.
ru_ru: Общий синтаксис командной строки выглядит следующим образом.

source: The bit width of the address bits.
ru_ru: Число адресных битов.

source: str on south edge (input, bit width 1)
ru_ru: str на южном крае (вход, разрядность равна 1)

source: You may not copy, modify, sublicense, or distribute the Program except as expressly provided under this License.
ru_ru: Вы не можете копировать, изменять, повторно лицензировать, или распространять Программу иначе, чем это явно предусмотрено данной Лицензией.

source: Wires are also non-directional; that is, they carry values from either endpoint to the other.
ru_ru: Провода также не направленные; то есть они передают значения из обеих своих конечных точек в другую.

source: Component: The name of the component.
ru_ru: Компонент: название компонента.

source: Indeed, a wire can carry values in both directions simultaneously: In the below example, a bit flows from the upper input at left through the center wire, then it circles back through the center wire, and then it circles forward again through the center wire before reaching the output at lower right.
ru_ru: Действительно, провод может передавать значения в обоих направлениях одновременно: в приведенном ниже примере бит проходит из верхнего входа слева через центральный провод, затем он проходит обратно через центральный провод, и снова в прямом направлении через центральный провод, пока не достигнет выхода справа вверху.

source: /** The configureNewInstance method is invoked every time a new instance
ru_ru: /** Метод configureNewInstance вызывается каждый раз, когда создаётся

source: When loading such a JAR, Logisim will prompt you to type a class name.
ru_ru: При загрузке таких JAR, Logisim предложит вам ввести имя класса.

source: The pop-up menu for most components has two items.
ru_ru: Всплывающее меню для большинства компонентов состоит из двух элементов.

source: END OF TERMS AND CONDITIONS
ru_ru: КОНЕЦ ОПРЕДЕЛЕНИЙ И УСЛОВИЙ

source: For each output variable, the Combinational Analysis window maintains two structures - the relevant column of the truth table, and a Boolean expression - specifying how each output relates to its input.
ru_ru: Для каждой выходной переменной окно Комбинационный анализ поддерживает две структуры - соответствующую колонку таблицы истинности и логическое выражение - указывающее, как каждый выход связан со своими входами.

source: There is an important subtlety in defining such components: You can't have the component itself store the state, because an individual component can appear many times in the same circuit.
ru_ru: Существует важная тонкость в объявлении таких компонентов: у вас не может быть компонента, который сам по себе хранит состояние, так как конкретный компонент может встречаться несколько раз в той же схеме.

source: As you draw wires, you may see some blue or gray wires.
ru_ru: Когда вы рисуете провода, вы можете увидеть несколько синих или серых проводов.

source: The number of bits by which to shift the data input.
ru_ru: Количество битов значения, на которое нужно сдвигать значение на входе данные.

source: Adds a new circuit into the current project.
ru_ru: Добавляет новую схему в текущий проект.

source: The Memory library includes components that remember information.
ru_ru: Библиотека Память включает компоненты, которые запоминают информацию.

source: Note: There's nothing wrong with editing a circuit that is being used as a subcircuit; in fact, this is quite common.
ru_ru: Примечание: нет ничего плохого в редактировании схемы, используемой как подсхема; вообще-то, это довольно обычное дело.

source: When you work with multi-bit values, you will often want to route different bits in different directions.
ru_ru: При работе с многобитными значениями вам часто захочется направить разные биты по разным направлениям.

source: Subsections:
ru_ru: Подразделы:

source: Displays the Logisim version number.
ru_ru: Отображает номер версии Logisim.

source: Logisim's built-in components don't include anything working with Gray codes.
ru_ru: Встроенные компоненты Logisim не включают в себя ничего, что работало бы с кодом Грея.

source: The value to be shifted.
ru_ru: Значение, которое будет сдвинуто.

source: Buffers are the most useless of the gate components provided in Logisim; its presence in the Gates library is just as much a matter of completeness (a component for each possible one-input truth table) as it is a matter of providing useful functionality.
ru_ru: Буферы - самый бесполезный из элементов, предусмотренных в Logisim; его присутствие в библиотеке Элементы скорее вопрос полноты (компонент для каждой возможной одновходовой таблицы истинности), чем вопрос предоставления полезной функциональности.

source: Typing the Enter key will move to editing the value just below it in the display (down one line).
ru_ru: Нажатие клавиши Enter приведёт к редактированию значения на одну строку ниже.

source: The pop-up menu includes options labeled Distribute Ascending and Distribute Descending.
ru_ru: Всплывающее меню включает в себя варианты "Расставить по возрастанию" и "Расставить по убыванию".

source: File format
ru_ru: Формат файла

source: For example, 11001011 logically shifted left twice is 00101100.
ru_ru: Например, 11001011 логически сдвинутое влево на два - это 00101100.

source: 1 if the first input equals the second input, 0 if the first input is not equal the second input.
ru_ru: На этом выходе 1, если значение на первом входе равно значению на втором, и 0, если они не равны.

source: After you have all the components blocked out on the canvas, you're ready to start adding wires.
ru_ru: После того, как все компоненты закреплены на холсте, вы готовы начать добавление проводов.

source: On opening the Combinational Analysis window, you will see that it consists of five tabs.
ru_ru: При открытии окна Комбинационный анализ вы увидите, что оно состоит из пяти вкладок.

source: Dot Shape
ru_ru: Форма точки

source: Moves the currently displayed circuit one step down the list of circuits within the project, as displayed in the explorer pane.
ru_ru: Перемещает отображаемую в данный момент схему на одну позицию вниз в списке схем проекта, показанном в панели проводника.

source: You can edit the current values appearing in the output columns by clicking on the value of interest.
ru_ru: Вы можете изменять текущие значения, входящие в столбцы с выходами, нажимая на интересующее значение.

source: (See the note under the Cut menu item.)
ru_ru: (См. примечание к пункту меню Вырезать.)

source: Also because of this behavior, the current ROM contents are stored in files created by Logisim.
ru_ru: Также, из-за такого поведения, текущее содержимое ПЗУ хранится в файлах, созданных Logisim.

source: * through attributes.
ru_ru: * через атрибуты.

source: (Sometimes it will delete or shorten existing wires.) If you're performing a move where you do not want these changes to be made, you can press the shift key during the move.
ru_ru: (Иногда он будет удалять или укорачивать существующие провода.) Если вы выполняете перемещение, для которого вы не хотите выполнения этих изменений, вы можете нажать клавишу Shift при перемещении.

source: You may find some libraries developed for older versions of Logisim, in which components were developed by defining two classes, one extending Component and another extending ComponentFactory.
ru_ru: Вы можете найти некоторые библиотеки, разработанные для более ранних версий Logisim, в которых компоненты были разработаны путём объявления двух классов; один - расширяющий Component и другой - расширяющий ComponentFactory.

source: West edge, top pin (input, bit width 1)
ru_ru: Западный край, верхний контакт (вход, разрядность равна 1)

source: Unload Libraries...
ru_ru: Выгрузить библиотеки

source: /* The "offset bounds" is the location of the bounding rectangle
ru_ru: /* "Offset bounds" - это положение ограничивающего прямоугольника

source: However, the Trigger attribute allows this to change to a falling edge (when the clock input changes from 1 to 0), a high level (for the duration that the clock input is 1), or a low level (for the duration that the clock input is 0).
ru_ru: Впрочем, атрибут Срабатывание позволяет сменить это на задний фронт (когда значение на тактовом входе меняется с 1 на 0), на Высокий уровень (срабатывать непрерывно на протяжении времени, когда на тактовом входе 1), или на Низкий уровень (срабатывать непрерывно на протяжении времени 0).

source: When the value is an error value (such as would occur when two conflicting values are being fed into the input), then the output is an error value.
ru_ru: Когда значение - значение ошибки (такое может случится, когда два противоречивых значения поступают на вход), то на выходе - тоже значение ошибки.

source: The component constantly outputs on this pin whatever value specified in the Value attribute.
ru_ru: Компонент постоянно имеет на выходном контакте значение, указанное в атрибуте Значение.

source: The number of bits traveling along a wire is that wire's bit width.
ru_ru: Количество битов, проходящих по проводу - это разрядность данного провода.

source: It receives a sequence of ASCII codes and displays each printable character.
ru_ru: Он принимает последовательность ASCII кодов и отображает каждый печатаемый символ.

source: We protect your rights with two steps: (1) copyright the software, and (2) offer you this license which gives you legal permission to copy, distribute and/or modify the software.
ru_ru: Мы защищаем ваши права в два этапа: (1) сохраняем авторские права на ПО и (2) предлагаем вам эту лицензию, которая дает вам законное право копировать, распространять и/или модифицировать ПО.

source: South edge (output, bit width 1)
ru_ru: Южный край (выход, разрядность равна 1)

source: A single percent sign ('%')
ru_ru: Одиночный знак процента ('%')

source: Once you click on the error entry, you will be in the 0-1-x cycle; there is no way to go back.
ru_ru: Как только вы нажмёте на значение ошибки, вы войдёте в цикл 0-1-x; вернуться назад возможности нет.

source: (Exception: if the Program itself is interactive but
ru_ru: (Исключение: если сама Программа работает в интерактивном режиме, но

source: But we want to execute the circuit using adder-query.circ rather than adder-master.circ as the loaded library.
ru_ru: Но мы хотим выполнить схему, используя как загруженную библиотеку adder-query.circ вместо adder-master.circ.

source: Selects how the pins correspond to pixels, as outlined above.
ru_ru: Определяет, как контакты соответствуют пикселям (как описано выше).

source: Upon releasing the mouse button, the output reverts back to 0.
ru_ru: По отпусканию кнопки мыши значение на выходе снова становится 0.

source: The p-gate input's line has a circle, while the n-gate input's line does not.
ru_ru: У линии входа p-затвор есть кружок, а у линии входа n-затвор его нет.

source: You can load three types of libraries, as explained elsewhere in the User's Guide.
ru_ru: Вы можете загружать три типа библиотек, как описано в другом месте Руководства пользователя.

source: Frequently, you'd want to
ru_ru: Часто вам захочется

source: Behavior
ru_ru: Поведение

source: The values seen in the layout will be part of the same hierarchy as those of the supercircuit.
ru_ru: Значения, наблюдаемые на чертеже, будут частью той же иерархии, что у вышестоящей схемы.

source: parties under the terms of this License.
ru_ru: оговоренных в данной Лицензии.

source: // method.
ru_ru: // метод.

source: Bit Selector
ru_ru: Селектор битов

source: That leaves the toolbar and the canvas.
ru_ru: Остаётся панель инструментов и холст.

source: Pin
ru_ru: Контакт

source: (If the number of split ends doesn't divide exactly into the number of bits, then the bits are distributed as evenly as possible.) Distribute Descending does the same but starts from the highest-numbered end.
ru_ru: (Если количество разъединённых концов не делит количество битов нацело, то биты распределяются как можно более равномерно). "Расставить по убыванию" делает то же самое, но начинает с конца с наибольшим номером.

source: Cut
ru_ru: Вырезать

source: If it's being transformed into a large bit width, the lowest-order bits are the same, and you have a choice about what the additional high-order bits will be: They can all be 0, all be 1, all match the input's sign bit (its highest-order bit), or the component can have an additional one-bit input that determines the identity of these other bits.
ru_ru: Если оно преобразуется в большую разрядность, то младшие биты остаются теми же, и вы можете выбрать, какими будут дополнительные старшие биты: они могут быть все 0, все 1, все соответствовать биту знака значения на входе (его самому старшему биту), или компонент может иметь дополнительный однобитный вход, который определяет, какими будут эти биты.

source: The counter remains unchanged.
ru_ru: Значение счётчика остаётся неизменным

source: But if there are more than two specified inputs, the XOR gate will emit 1 only when there is exactly one 1 input, whereas the Odd Parity gate will emit 1 if there are an odd number of 1 inputs.
ru_ru: Но если входов с определённым значением больше двух, то элемент Исключающее ИЛИ будет давать на выходе 1, когда единица строго на одном входе, тогда как элемент Нечётность даст на выходе 1, когда единица на нечётном количестве входов.

source: And place the two NOT gates into the canvas using the NOT tool ().
ru_ru: И расположите два элемента НЕ на холсте, используя инструмент Элемент НЕ ().

source: This does not happen when all ports are selected.
ru_ru: Этого не происходит, если выбраны все порты.

source: Note that when the logging module switches to logging another simulation, it will cease any logging into a file.
ru_ru: Заметьте, что когда модуль ведения журнала переключается на запись другого моделирования, он перестаёт записывать что-либо в файл.

source: Command-line verification
ru_ru: Проверка из командной строки

source: * generating the state if necessary.
ru_ru: * генерируя состояние, если необходимо.

source: You are not required to accept this License, since you have not signed it.
ru_ru: Вы не обязаны соглашаться с этой Лицензией, так как вы не подписывали ее.

source: a) You must cause the modified files to carry prominent notices
ru_ru: a) Вы обязаны снабдить модифицированные файлы заметными уведомлениями,

source: In such a circuit, the values sent and received to those locations on the subcircuit component are tied to the pins within the subcircuit layout.
ru_ru: В такой схеме значения, переданные и принятые в этих точках компонента Подсхема, связаны с контактами внутри чертежа подсхемы.

source: After each propagation is completed, Logisim loads the current values of the output pins; if any have changed from the previous propagation, then all values are displayed in tab-delimited format.
ru_ru: После завершения каждого просчёта Logisim снимает значения с выходных контактов; если любое из них изменилось после предыдущего просчёта, то выводятся все значения, разделённые символами табуляции.

source: The component includes a single port on its east side that serves for both loading and storing data.
ru_ru: Компонент имеет один порт на восточном крае, который служит для чтения и записи данных.

source: In drawing a pin, Logisim represents output pins using a circle or rounded rectangle, and input pins are represented using squares or rectangles.
ru_ru: При отрисовке контакта Logisim представляет выходные контакты как кружки или скруглённые прямоугольники, а входные контакты как квадраты или прямоугольники.

source: The Edit menu
ru_ru: Меню Правка
